/********************************************************************************** 
*
*问题：给出一个数组A[],个数为n，一个值elem。去除数组里面全部值为elem的数，返回新数组的长度，得到没有elem值顺序一样的一个数组。
*方法一：从0到n-1循环，A[i-num] = A[i];将后面的数往前num赋值。num为遇到第几个elem相等的值。
*
*
**********************************************************************************/

//方法一
//8MS
class Solution {
public:
	int removeElement(int A[], int n, int elem) {
		int num = 0;
		int i;
		for(i=0; i<n; i++)
		{
			A[i-num] = A[i];
			if(A[i] == elem)
			{
				num++;
			}
		}
		return (n-num);
	}
};