/********************************************************************************** 
*
*问题：给出一个数组A[],个数为n。每个数都会出现三次，除了一个特别的数出现一次，找出这个数。
*方法一：先将数组排序，从0到n-1相邻两个判断是否相等，每次循环i+3，如果不等，则A[i]为single number。
*
*
**********************************************************************************/

//方法一
//21MS
class Solution {
public:
	int singleNumber(int A[], int n) {
		if(n == 0) return 0;
		else if(n == 1) return A[0];
		sort(A, A+n);
		int i;
		for(i=0; i<n-1; i+=3)
		{
			if(A[i] != A[i+1])
			{
				break;
			}
		}
		if(i == 0) return A[0];
		return A[i];
	}
};